daas/esloadtestpostsearchsimulation30x1m-1481549762980/simulation.log
[INFO] Scanning for projects...
[WARNING] 
[WARNING] Some problems were encountered while building the effective model for com.datio.daas.testPF:testPF:jar:1.0-SNAPSHOT
[WARNING] 'build.plugins.plugin.(groupId:artifactId)' must be unique but found duplicate declaration of plugin net.alchim31.maven:scala-maven-plugin @ line 62, column 21
[WARNING] 'parent.relativePath' points at com.datio.daas:daas instead of com.stratio:parent, please verify your project structure @ line 24, column 13
[WARNING] 
[WARNING] It is highly recommended to fix these problems because they threaten the stability of your build.
[WARNING] 
[WARNING] For this reason, future Maven versions might no longer support building such malformed projects.
[WARNING] 
[INFO]                                                                         
[INFO] ------------------------------------------------------------------------
[INFO] Building testPF 1.0-SNAPSHOT
[INFO] ------------------------------------------------------------------------
[INFO] 
[INFO] --- maven-clean-plugin:2.5:clean (default-clean) @ testPF ---
[INFO] Deleting /home/david/workspace/daas/testPF/target
[INFO] 
[INFO] --- maven-resources-plugin:3.0.1:resources (default-resources) @ testPF ---
[INFO] Using 'UTF-8' encoding to copy filtered resources.
[INFO] skip non existing resourceDirectory /home/david/workspace/daas/testPF/src/main/resources
[INFO] 
[INFO] --- scala-maven-plugin:3.2.2:add-source (scala-compile-first) @ testPF ---
[INFO] Add Source directory: /home/david/workspace/daas/testPF/src/main/scala
[INFO] Add Test Source directory: /home/david/workspace/daas/testPF/src/test/scala
[INFO] 
[INFO] --- scala-maven-plugin:3.2.2:compile (scala-compile-first) @ testPF ---
[WARNING]  Expected all dependencies to require Scala version: 2.11.6
[WARNING]  com.datio.daas.testPF:testPF:1.0-SNAPSHOT requires scala version: 2.11.6
[WARNING]  io.gatling.highcharts:gatling-charts-highcharts:2.1.7 requires scala version: 2.11.7
[WARNING] Multiple versions of scala libraries detected!
[INFO] No sources to compile
[INFO] 
[INFO] --- maven-resources-plugin:3.0.1:copy-resources (copy-resources) @ testPF ---
[INFO] Using 'UTF-8' encoding to copy filtered resources.
[INFO] Copying 1 resource
[INFO] 
[INFO] --- maven-compiler-plugin:3.1:compile (default-compile) @ testPF ---
[INFO] No sources to compile
[INFO] 
[INFO] --- maven-resources-plugin:3.0.1:testResources (default-testResources) @ testPF ---
[INFO] Using 'UTF-8' encoding to copy filtered resources.
[INFO] Copying 3 resources
[INFO] 
[INFO] --- scala-maven-plugin:3.2.2:testCompile (scala-test-compile) @ testPF ---
[WARNING]  Expected all dependencies to require Scala version: 2.11.6
[WARNING]  com.datio.daas.testPF:testPF:1.0-SNAPSHOT requires scala version: 2.11.6
[WARNING]  io.gatling.highcharts:gatling-charts-highcharts:2.1.7 requires scala version: 2.11.7
[WARNING] Multiple versions of scala libraries detected!
[INFO] /home/david/workspace/daas/testPF/src/test/scala:-1: info: compiling
[INFO] Compiling 21 source files to /home/david/workspace/daas/testPF/target/test-classes at 1481549738861
[INFO] prepare-compile in 0 s
[INFO] compile in 7 s
[INFO] 
[INFO] --- maven-compiler-plugin:3.1:testCompile (default-testCompile) @ testPF ---
[INFO] Nothing to compile - all classes are up to date
[INFO] 
[INFO] --- maven-surefire-plugin:2.7:test (default-test) @ testPF ---
[INFO] Tests are skipped.
[INFO] 
[INFO] --- maven-jar-plugin:2.4:jar (default-jar) @ testPF ---
[WARNING] JAR will be empty - no content was marked for inclusion!
[INFO] Building jar: /home/david/workspace/daas/testPF/target/testPF-1.0-SNAPSHOT.jar
[INFO] 
[INFO] --- gatling-maven-plugin:2.1.7:execute (default) @ testPF ---
Simulation com.datiobd.daas.testPF.simulations.EsLoadTestPostSearchSimulation30x1m started...
[WARN] [12/12/2016 14:35:56.592] [Base-Simulation-akka.actor.default-dispatcher-2] [akka.actor.ActorSystemImpl(Base-Simulation)] Explicitly set HTTP header 'Content-Type: application/json' is ignored, illegal RawHeader
[WARN] [12/12/2016 14:35:56.692] [Base-Simulation-akka.actor.default-dispatcher-4] [akka.actor.ActorSystemImpl(Base-Simulation)] Explicitly set HTTP header 'Content-Type: application/json' is ignored, illegal RawHeader
[WARN] [12/12/2016 14:35:56.915] [Base-Simulation-akka.actor.default-dispatcher-4] [akka.actor.ActorSystemImpl(Base-Simulation)] Explicitly set HTTP header 'Content-Type: application/json' is ignored, illegal RawHeader

================================================================================
2016-12-12 14:36:03                                           0s elapsed
---- EsLoadTestPostSearchSimulation30x1m ---------------------------------------
[                                                                          ]  0%
          waiting: 30     / active: 0      / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=0      KO=0     )

================================================================================


================================================================================
2016-12-12 14:36:07                                           5s elapsed
---- EsLoadTestPostSearchSimulation30x1m ---------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 30     / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=803    KO=0     )
> EsLoadTestPostSearchSimulation30x1m                      (OK=803    KO=0     )
================================================================================


================================================================================
2016-12-12 14:36:13                                          10s elapsed
---- EsLoadTestPostSearchSimulation30x1m ---------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 30     / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=2238   KO=0     )
> EsLoadTestPostSearchSimulation30x1m                      (OK=2238   KO=0     )
================================================================================


================================================================================
2016-12-12 14:36:18                                          15s elapsed
---- EsLoadTestPostSearchSimulation30x1m ---------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 30     / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=3778   KO=0     )
> EsLoadTestPostSearchSimulation30x1m                      (OK=3778   KO=0     )
================================================================================


================================================================================
2016-12-12 14:36:23                                          20s elapsed
---- EsLoadTestPostSearchSimulation30x1m ---------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 30     / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=5381   KO=0     )
> EsLoadTestPostSearchSimulation30x1m                      (OK=5381   KO=0     )
================================================================================


================================================================================
2016-12-12 14:36:28                                          25s elapsed
---- EsLoadTestPostSearchSimulation30x1m ---------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 30     / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=6963   KO=0     )
> EsLoadTestPostSearchSimulation30x1m                      (OK=6963   KO=0     )
================================================================================


================================================================================
2016-12-12 14:36:33                                          30s elapsed
---- EsLoadTestPostSearchSimulation30x1m ---------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 30     / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=8701   KO=0     )
> EsLoadTestPostSearchSimulation30x1m                      (OK=8701   KO=0     )
================================================================================


================================================================================
2016-12-12 14:36:38                                          35s elapsed
---- EsLoadTestPostSearchSimulation30x1m ---------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 30     / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=10144  KO=0     )
> EsLoadTestPostSearchSimulation30x1m                      (OK=10144  KO=0     )
================================================================================


================================================================================
2016-12-12 14:36:43                                          40s elapsed
---- EsLoadTestPostSearchSimulation30x1m ---------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 30     / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=11876  KO=0     )
> EsLoadTestPostSearchSimulation30x1m                      (OK=11876  KO=0     )
================================================================================


================================================================================
2016-12-12 14:36:48                                          45s elapsed
---- EsLoadTestPostSearchSimulation30x1m ---------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 30     / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=13416  KO=0     )
> EsLoadTestPostSearchSimulation30x1m                      (OK=13416  KO=0     )
================================================================================


================================================================================
2016-12-12 14:36:53                                          50s elapsed
---- EsLoadTestPostSearchSimulation30x1m ---------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 30     / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=15187  KO=0     )
> EsLoadTestPostSearchSimulation30x1m                      (OK=15187  KO=0     )
================================================================================


================================================================================
2016-12-12 14:36:58                                          55s elapsed
---- EsLoadTestPostSearchSimulation30x1m ---------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 30     / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=16962  KO=0     )
> EsLoadTestPostSearchSimulation30x1m                      (OK=16962  KO=0     )
================================================================================

14:37:01.632 [GatlingSystem-akka.actor.default-dispatcher-11][WARN ][AsyncHandlerActor.scala:119] i.g.h.a.AsyncHandlerActor - Request 'EsLoadTestPostSearchSimulation30x1m' failed: status.find.is(200), but actually found 404
14:37:01.632 [GatlingSystem-akka.actor.default-dispatcher-4][WARN ][AsyncHandlerActor.scala:119] i.g.h.a.AsyncHandlerActor - Request 'EsLoadTestPostSearchSimulation30x1m' failed: status.find.is(200), but actually found 404
14:37:01.632 [GatlingSystem-akka.actor.default-dispatcher-6][WARN ][AsyncHandlerActor.scala:119] i.g.h.a.AsyncHandlerActor - Request 'EsLoadTestPostSearchSimulation30x1m' failed: status.find.is(200), but actually found 404
14:37:01.632 [GatlingSystem-akka.actor.default-dispatcher-9][WARN ][AsyncHandlerActor.scala:119] i.g.h.a.AsyncHandlerActor - Request 'EsLoadTestPostSearchSimulation30x1m' failed: status.find.is(200), but actually found 404
14:37:01.632 [GatlingSystem-akka.actor.default-dispatcher-2][WARN ][AsyncHandlerActor.scala:119] i.g.h.a.AsyncHandlerActor - Request 'EsLoadTestPostSearchSimulation30x1m' failed: status.find.is(200), but actually found 404

================================================================================
2016-12-12 14:37:03                                          60s elapsed
---- EsLoadTestPostSearchSimulation30x1m ---------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 30     / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=18736  KO=5     )
> EsLoadTestPostSearchSimulation30x1m                      (OK=18736  KO=5     )
---- Errors --------------------------------------------------------------------
> status.find.is(200), but actually found 404                         5 (100,0%)
================================================================================

14:37:04.588 [GatlingSystem-akka.actor.default-dispatcher-2][WARN ][AsyncHandlerActor.scala:119] i.g.h.a.AsyncHandlerActor - Request 'EsLoadTestPostSearchSimulation30x1m' failed: status.find.is(200), but actually found 404
14:37:04.600 [GatlingSystem-akka.actor.default-dispatcher-4][WARN ][AsyncHandlerActor.scala:119] i.g.h.a.AsyncHandlerActor - Request 'EsLoadTestPostSearchSimulation30x1m' failed: status.find.is(200), but actually found 404
14:37:04.606 [GatlingSystem-akka.actor.default-dispatcher-11][WARN ][AsyncHandlerActor.scala:119] i.g.h.a.AsyncHandlerActor - Request 'EsLoadTestPostSearchSimulation30x1m' failed: status.find.is(200), but actually found 404
14:37:04.607 [GatlingSystem-akka.actor.default-dispatcher-4][WARN ][AsyncHandlerActor.scala:119] i.g.h.a.AsyncHandlerActor - Request 'EsLoadTestPostSearchSimulation30x1m' failed: status.find.is(200), but actually found 404
14:37:04.608 [GatlingSystem-akka.actor.default-dispatcher-9][WARN ][AsyncHandlerActor.scala:119] i.g.h.a.AsyncHandlerActor - Request 'EsLoadTestPostSearchSimulation30x1m' failed: status.find.is(200), but actually found 404
14:37:04.608 [GatlingSystem-akka.actor.default-dispatcher-12][WARN ][AsyncHandlerActor.scala:119] i.g.h.a.AsyncHandlerActor - Request 'EsLoadTestPostSearchSimulation30x1m' failed: status.find.is(200), but actually found 404
14:37:04.609 [GatlingSystem-akka.actor.default-dispatcher-12][WARN ][AsyncHandlerActor.scala:119] i.g.h.a.AsyncHandlerActor - Request 'EsLoadTestPostSearchSimulation30x1m' failed: status.find.is(200), but actually found 404
14:37:04.610 [GatlingSystem-akka.actor.default-dispatcher-9][WARN ][AsyncHandlerActor.scala:119] i.g.h.a.AsyncHandlerActor - Request 'EsLoadTestPostSearchSimulation30x1m' failed: status.find.is(200), but actually found 404
14:37:04.615 [GatlingSystem-akka.actor.default-dispatcher-9][WARN ][AsyncHandlerActor.scala:119] i.g.h.a.AsyncHandlerActor - Request 'EsLoadTestPostSearchSimulation30x1m' failed: status.find.is(200), but actually found 404
14:37:04.620 [GatlingSystem-akka.actor.default-dispatcher-11][WARN ][AsyncHandlerActor.scala:119] i.g.h.a.AsyncHandlerActor - Request 'EsLoadTestPostSearchSimulation30x1m' failed: status.find.is(200), but actually found 404
14:37:04.623 [GatlingSystem-akka.actor.default-dispatcher-9][WARN ][AsyncHandlerActor.scala:119] i.g.h.a.AsyncHandlerActor - Request 'EsLoadTestPostSearchSimulation30x1m' failed: status.find.is(200), but actually found 404
14:37:04.625 [GatlingSystem-akka.actor.default-dispatcher-2][WARN ][AsyncHandlerActor.scala:119] i.g.h.a.AsyncHandlerActor - Request 'EsLoadTestPostSearchSimulation30x1m' failed: status.find.is(200), but actually found 404
14:37:04.633 [GatlingSystem-akka.actor.default-dispatcher-9][WARN ][AsyncHandlerActor.scala:119] i.g.h.a.AsyncHandlerActor - Request 'EsLoadTestPostSearchSimulation30x1m' failed: status.find.is(200), but actually found 404
14:37:04.634 [GatlingSystem-akka.actor.default-dispatcher-13][WARN ][AsyncHandlerActor.scala:119] i.g.h.a.AsyncHandlerActor - Request 'EsLoadTestPostSearchSimulation30x1m' failed: status.find.is(200), but actually found 404
14:37:04.634 [GatlingSystem-akka.actor.default-dispatcher-12][WARN ][AsyncHandlerActor.scala:119] i.g.h.a.AsyncHandlerActor - Request 'EsLoadTestPostSearchSimulation30x1m' failed: status.find.is(200), but actually found 404
14:37:04.647 [GatlingSystem-akka.actor.default-dispatcher-14][WARN ][AsyncHandlerActor.scala:119] i.g.h.a.AsyncHandlerActor - Request 'EsLoadTestPostSearchSimulation30x1m' failed: status.find.is(200), but actually found 404
14:37:04.669 [GatlingSystem-akka.actor.default-dispatcher-9][WARN ][AsyncHandlerActor.scala:119] i.g.h.a.AsyncHandlerActor - Request 'EsLoadTestPostSearchSimulation30x1m' failed: status.find.is(200), but actually found 404

================================================================================
2016-12-12 14:37:05                                          62s elapsed
---- EsLoadTestPostSearchSimulation30x1m ---------------------------------------
[##########################################################################]100%
          waiting: 0      / active: 0      / done:30    
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=19411  KO=22    )
> EsLoadTestPostSearchSimulation30x1m                      (OK=19411  KO=22    )
---- Errors --------------------------------------------------------------------
> status.find.is(200), but actually found 404                        22 (100,0%)
================================================================================

Simulation finished
Stored in influxdb the monitoring part ElasticSearch - Before call
Stored in influxdb the monitoring part ElasticSearch - Call
Stored in influxdb the monitoring part ElasticSearch - After call
Monitoring is stored in influxdb
Opening http://localhost:3000/dashboard/db/daas-hetzner-hdw?from=1481549762293&to=1481549827880
Opening http://localhost:3000/dashboard/db/daas-hetzner-monitoring
Parsing log file(s)...
Parsing log file(s) done
Generating reports...

================================================================================
---- Global Information --------------------------------------------------------
> request count                                      19433 (OK=19411  KO=22    )
> min response time                                     40 (OK=49     KO=40    )
> max response time                                   1100 (OK=1100   KO=104   )
> mean response time                                    92 (OK=92     KO=56    )
> std deviation                                         49 (OK=49     KO=22    )
> response time 50th percentile                         84 (OK=84     KO=45    )
> response time 75th percentile                         94 (OK=94     KO=57    )
> mean requests/sec                                308.676 (OK=308.326 KO=0.349 )
---- Response Time Distribution ------------------------------------------------
> t < 800 ms                                         19367 (100%)
> 800 ms < t < 1200 ms                                  44 (  0%)
> t > 1200 ms                                            0 (  0%)
> failed                                                22 (  0%)
---- Errors --------------------------------------------------------------------
> status.find.is(200), but actually found 404                        22 (100,0%)
================================================================================

Reports generated in 0s.
Please open the following file: /home/david/workspace/daas/testPF/target/gatling/results/esloadtestpostsearchsimulation30x1m-1481549762980/index.html
[INFO] ------------------------------------------------------------------------
[INFO] BUILD SUCCESS
[INFO] ------------------------------------------------------------------------
[INFO] Total time: 01:54 min
[INFO] Finished at: 2016-12-12T14:37:31+01:00
[INFO] Final Memory: 18M/313M
[INFO] ------------------------------------------------------------------------